app/controllers/ideas_controller.rb

SELECT * FROM "ideas" WHERE (user_id = 1) ORDER BY created_at DESC
---
  def index
    @ideas = Idea.all(:conditions => ["user_id = ?", current_user], :order => "created_at DESC")

SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)
---
  def show
    @idea = Idea.find(params[:id])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 1)
---
  def edit
    @idea = Idea.find(params[:id])

INSERT INTO "ideas" ("updated_at", "title", "description", "category_id", "user_id", "created_at") VALUES('2009-07-19 08:54:18', 'lost things', 'a website for cool antiques an hard to find things.
---
  def create
    @user = current_user
    @idea = @user.ideas.build(params[:idea])


    respond_to do |format|
      if @idea.save

SELECT * FROM "ideas" WHERE ("ideas"."id" = 3)
UPDATE "ideas" SET "description" = 'a site where i can post that i like someone secretly, people can login and search their name and see if anyone likes them, admirers can elect to disclose their identity.
---
  def update
    @idea = Idea.find(params[:id])

    respond_to do |format|
      if @idea.update_attributes(params[:idea])

SELECT * FROM "ideas" WHERE ("ideas"."id" = 2)
DELETE FROM "ideas" WHERE "id" = 2
---
  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy