app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("last_login_at", "updated_at", "last_request_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "first_name", "last_name", "login", "email", "created_at", "last_login_ip") VALUES(NULL, '2009-07-12 14:43:14', '2009-07-12 14:43:14', 'd3ce94327f2369920a9e563a23e64cc343445cc73e6d779a856fad3ed2809d58adef3f47eb7f8ba9fa234a4897dbde67a0d74406b31fa0f73a407c8f51d6edd2', '0', 'O-GfCN1nSPsozSvqd-3c', '127.0.0.1', 'PVwx3Uk1IsKkEsmti9g1', '2009-07-12 14:43:14', 0, '3dfbfbe02d7470236b6d2ca40005d04c266a3594ef1b0df72f004c10769c14f5b3697bc35e68cd67b6ab53c7bb15196b3e4835e2befaa260f4cec6d186156582', 1, NULL, NULL, 'elton', 'elton.stewart@gmail.com', '2009-07-12 14:43:14', NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "perishable_token" = 'rDCRyNRcHlj3cD82DMLm', "last_name" = 'Stewart', "updated_at" = '2009-07-12 14:44:12', "first_name" = 'elton' WHERE "id" = 1